#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azuread_client_config.current: Reading...
data.azuread_client_config.current: Read complete after 0s [id=26aa7ec7-96f9-4fda-a56c-b330c975f800-8e001e75-263f-4b2f-931e-f2037fcc675f-a26cff92-ab53-4342-8e68-f96dd7bbd9b4]
azuread_application.github_actions_aadapplication["shared_infrastructure"]: Refreshing state... [id=0ed0409f-9726-49b1-bdab-24976a80d8dd]
azuread_application.github_actions_aadapplication["backstage_test"]: Refreshing state... [id=96fd3546-c563-4995-b477-88da8c572ba5]
azuread_application_federated_identity_credential.cred["shared_infrastructure"]: Refreshing state... [id=0ed0409f-9726-49b1-bdab-24976a80d8dd/federatedIdentityCredential/93e3ce90-3f1e-4728-a91a-c14bf26a0535]
azuread_application_federated_identity_credential.cred["backstage_test"]: Refreshing state... [id=96fd3546-c563-4995-b477-88da8c572ba5/federatedIdentityCredential/7b3c2cc1-d201-4ade-8120-afea38a2fdb9]
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common]
azurerm_storage_account.terraform_state_storage: Refreshing state... [id=/subscriptions/bd8e250a-66a6-4038-acd8-0d6aced3e3c8/resourceGroups/rg-common/providers/Microsoft.Storage/storageAccounts/badbortcommontfstatesta]
azurerm_storage_container.terraform_state: Refreshing state... [id=https://badbortcommontfstatesta.blob.core.windows.net/common-infrastructure-tfstate]
azurerm_storage_container.tf_backends_sc["backstage_test"]: Refreshing state... [id=https://badbortcommontfstatesta.blob.core.windows.net/backstage-testing]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azuread_application.github_actions_aadapplication["shared_infrastructure"] will be destroyed
  # (because key ["shared_infrastructure"] is not in for_each map)
  - resource "azuread_application" "github_actions_aadapplication" {
      - app_role_ids                   = {} -> null
      - application_id                 = "a69e2a01-baf2-4619-8703-e49bb751ce7e" -> null
      - device_only_auth_enabled       = false -> null
      - disabled_by_microsoft          = "<nil>" -> null
      - display_name                   = "github-actions-shared-infrastructure-tf" -> null
      - fallback_public_client_enabled = false -> null
      - group_membership_claims        = [] -> null
      - id                             = "0ed0409f-9726-49b1-bdab-24976a80d8dd" -> null
      - identifier_uris                = [] -> null
      - oauth2_permission_scope_ids    = {} -> null
      - oauth2_post_response_required  = false -> null
      - object_id                      = "0ed0409f-9726-49b1-bdab-24976a80d8dd" -> null
      - owners                         = [
          - "a26cff92-ab53-4342-8e68-f96dd7bbd9b4",
        ] -> null
      - prevent_duplicate_names        = false -> null
      - publisher_domain               = "alekivankovicgmail.onmicrosoft.com" -> null
      - sign_in_audience               = "AzureADMyOrg" -> null
      - tags                           = [] -> null

      - api {
          - known_client_applications      = [] -> null
          - mapped_claims_enabled          = false -> null
          - requested_access_token_version = 1 -> null
        }

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - optional_claims {
        }

      - public_client {
          - redirect_uris = [] -> null
        }

      - single_page_application {
          - redirect_uris = [] -> null
        }

      - web {
          - redirect_uris = [] -> null

          - implicit_grant {
              - access_token_issuance_enabled = false -> null
              - id_token_issuance_enabled     = false -> null
            }
        }
    }

  # azuread_application_federated_identity_credential.cred["shared_infrastructure"] will be destroyed
  # (because key ["shared_infrastructure"] is not in for_each map)
  - resource "azuread_application_federated_identity_credential" "cred" {
      - application_object_id = "0ed0409f-9726-49b1-bdab-24976a80d8dd" -> null
      - audiences             = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id         = "93e3ce90-3f1e-4728-a91a-c14bf26a0535" -> null
      - description           = "Terraform deployments for badbort/shared-infrastructure" -> null
      - display_name          = "shared-infrastructure" -> null
      - id                    = "0ed0409f-9726-49b1-bdab-24976a80d8dd/federatedIdentityCredential/93e3ce90-3f1e-4728-a91a-c14bf26a0535" -> null
      - issuer                = "https://token.actions.githubusercontent.com" -> null
      - subject               = "repo:badbort/shared-infrastructure:environment:tf" -> null
    }

  # azuread_service_principal.github_actions_sp["backstage_test"] will be created
  + resource "azuread_service_principal" "github_actions_sp" {
      + account_enabled              = true
      + app_role_assignment_required = false
      + app_role_ids                 = (known after apply)
      + app_roles                    = (known after apply)
      + application_id               = "bcf4e9df-27fe-4b09-b642-5b76ca418fe6"
      + application_tenant_id        = (known after apply)
      + display_name                 = (known after apply)
      + homepage_url                 = (known after apply)
      + id                           = (known after apply)
      + logout_url                   = (known after apply)
      + oauth2_permission_scope_ids  = (known after apply)
      + oauth2_permission_scopes     = (known after apply)
      + object_id                    = (known after apply)
      + redirect_uris                = (known after apply)
      + saml_metadata_url            = (known after apply)
      + service_principal_names      = (known after apply)
      + sign_in_audience             = (known after apply)
      + tags                         = (known after apply)
      + type                         = (known after apply)

      + feature_tags {
          + custom_single_sign_on = (known after apply)
          + enterprise            = (known after apply)
          + gallery               = (known after apply)
          + hide                  = (known after apply)
        }

      + features {
          + custom_single_sign_on_app = (known after apply)
          + enterprise_application    = (known after apply)
          + gallery_application       = (known after apply)
          + visible_to_users          = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @badbort, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/terraform.yml`*